package leetcode.com.pickup1.medium;

import java.util.List;

/**
 * Created by tclresearchamerica on 6/23/16.
 * ****************************************************
 * Location:
 * https://leetcode.com/problems/restore-ip-addresses/
 * ****************************************************
 * Description:
 * Given a string containing only digits, restore it by returning all possible valid IP address combinations.
 * For example:
 * Given "25525511135",
 * return ["255.255.11.135", "255.255.111.35"]. (Order does not matter)
 * ****************************************************
 * Thoughts:
 * 1.第一反应因为要寻求所有的解,所以可以考虑用递归的方式解决问题
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 * ****************************************************
 */
public class No093_Restore_IP_Addresses {

    public List<String> restoreIpAddresses(String s) {

    }
}
